In [1]:
import pandas as pd  
import numpy as np

#   How to convert the dataframe into csv file

In [2]:
df = pd.DataFrame(np.random.rand(5,5),index = ['0','1','2','3','4'])

In [3]:
df.columns = ['a','b','c','d','e']

In [4]:
df

          a         b         c         d         e
0  0.346012  0.681926  0.874207  0.380095  0.235068
1  0.511720  0.540302  0.813905  0.686656  0.324201
2  0.906274  0.691735  0.156205  0.036587  0.952932
3  0.774229  0.800311  0.063732  0.982186  0.643809
4  0.233097  0.699467  0.165254  0.742583  0.854209

Dataframe -----------> CSV

In [5]:
df.to_csv("My_file.csv")

#  To read csv file

In [6]:
pd.read_csv('My_file.csv')

   Unnamed: 0         a         b         c         d         e
0           0  0.346012  0.681926  0.874207  0.380095  0.235068
1           1  0.511720  0.540302  0.813905  0.686656  0.324201
2           2  0.906274  0.691735  0.156205  0.036587  0.952932
3           3  0.774229  0.800311  0.063732  0.982186  0.643809
4           4  0.233097  0.699467  0.165254  0.742583  0.854209

#  Indexing and selecting data

In [7]:
ser = pd.Series(range(5), index=list("abcde"))
ser

a    0
b    1
c    2
d    3
e    4
dtype: int64

To find the elements by using indexing

In [8]:
ser.loc[['a','c','e']]

a    0
c    2
e    4
dtype: int64

In [9]:
df = pd.DataFrame(np.arange(25).reshape(5, 5), index=list("abcde"), columns=list("abcde"))

In [10]:
df

    a   b   c   d   e
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [11]:
df.loc[["a", "c", "e"], ["b", "d"]]

    b   d
a   1   3
c  11  13
e  21  23

 # Basics

To create the data in row

In [12]:
dates = pd.date_range('30/4/2025', periods=8)

In [13]:
dates

DatetimeIndex(['2025-04-30', '2025-05-01', '2025-05-02', '2025-05-03',
               '2025-05-04', '2025-05-05', '2025-05-06', '2025-05-07'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df = pd.DataFrame(np.random.randn(8, 4),
                  index=dates, columns=['A', 'B', 'C', 'D'])

In [15]:
df

                   A         B         C         D
2025-04-30 -0.197689 -0.799564 -0.154904 -0.289796
2025-05-01 -0.826898  0.642195 -0.815380  0.993801
2025-05-02  0.726360  1.280598 -0.001819  0.653249
2025-05-03 -2.699077 -0.307654  1.433218  0.382637
2025-05-04  0.634004 -0.121700 -0.809602  1.032725
2025-05-05 -0.707794 -0.165635 -0.695989  1.397055
2025-05-06  0.065573 -1.139339  0.425731  1.663959
2025-05-07  1.185116 -0.683723  1.110141 -0.899356

In [16]:
s = df['A']
s

2025-04-30   -0.197689
2025-05-01   -0.826898
2025-05-02    0.726360
2025-05-03   -2.699077
2025-05-04    0.634004
2025-05-05   -0.707794
2025-05-06    0.065573
2025-05-07    1.185116
Freq: D, Name: A, dtype: float64

In [17]:
s[dates[5]]

np.float64(-0.7077940506938011)

In [18]:
df[['B', 'A']] = df[['A', 'B']]

In [19]:
df

                   A         B         C         D
2025-04-30 -0.799564 -0.197689 -0.154904 -0.289796
2025-05-01  0.642195 -0.826898 -0.815380  0.993801
2025-05-02  1.280598  0.726360 -0.001819  0.653249
2025-05-03 -0.307654 -2.699077  1.433218  0.382637
2025-05-04 -0.121700  0.634004 -0.809602  1.032725
2025-05-05 -0.165635 -0.707794 -0.695989  1.397055
2025-05-06 -1.139339  0.065573  0.425731  1.663959
2025-05-07 -0.683723  1.185116  1.110141 -0.899356

In [20]:
df[['A', 'B']]

                   A         B
2025-04-30 -0.799564 -0.197689
2025-05-01  0.642195 -0.826898
2025-05-02  1.280598  0.726360
2025-05-03 -0.307654 -2.699077
2025-05-04 -0.121700  0.634004
2025-05-05 -0.165635 -0.707794
2025-05-06 -1.139339  0.065573
2025-05-07 -0.683723  1.185116

To sort the index in dataframe

In [21]:
df.sort_index()

                   A         B         C         D
2025-04-30 -0.799564 -0.197689 -0.154904 -0.289796
2025-05-01  0.642195 -0.826898 -0.815380  0.993801
2025-05-02  1.280598  0.726360 -0.001819  0.653249
2025-05-03 -0.307654 -2.699077  1.433218  0.382637
2025-05-04 -0.121700  0.634004 -0.809602  1.032725
2025-05-05 -0.165635 -0.707794 -0.695989  1.397055
2025-05-06 -1.139339  0.065573  0.425731  1.663959
2025-05-07 -0.683723  1.185116  1.110141 -0.899356

#  Boolean indexing

In [22]:
s = pd.Series(range(-3, 4))

In [23]:
s

0   -3
1   -2
2   -1
3    0
4    1
5    2
6    3
dtype: int64

In [24]:
s[s > 0]

4    1
5    2
6    3
dtype: int64

#  Indexing with isin

In [25]:
s = pd.Series(np.arange(5), index=np.arange(5)[::-1], dtype='int64')

In [26]:
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [27]:
s.isin([2, 4, 6])

4    False
3    False
2     True
1    False
0     True
dtype: bool

#  The where() Method and Masking

In [28]:
s[s > 0]

3    1
2    2
1    3
0    4
dtype: int64

In [29]:
s.where(s>0)

4    NaN
3    1.0
2    2.0
1    3.0
0    4.0
dtype: float64

#   Duplicate data

In [30]:
df2 = pd.DataFrame({'a': ['one', 'one', 'two', 'two', 'two', 'three', 'four'],
                    'b': ['x', 'y', 'x', 'y', 'x', 'x', 'x'],
                    'c': np.random.randn(7)})

In [31]:
df2

       a  b         c
0    one  x -2.152185
1    one  y -0.708241
2    two  x -0.063494
3    two  y -0.920026
4    two  x  0.795747
5  three  x  1.791891
6   four  x -1.378883

In [32]:
df2.duplicated('a')

0    False
1     True
2    False
3     True
4     True
5    False
6    False
dtype: bool

duplicated returns a boolean vector whose length is the number of rows, and which indicates whether a row is duplicated.

By default, the first observed row of a duplicate set is considered unique, but each method has a keep parameter to specify targets to be kept.

keep='first' (default): mark / drop duplicates except for the first occurrence.

keep='last': mark / drop duplicates except for the last occurrence.

keep=False: mark / drop all duplicates.

In [33]:
df2.duplicated('a', keep='last')

0     True
1    False
2     True
3     True
4    False
5    False
6    False
dtype: bool

In [34]:
df2.duplicated('a', keep=False)

0     True
1     True
2     True
3     True
4     True
5    False
6    False
dtype: bool

To drop duplicate the values

In [35]:
df2.drop_duplicates('a')

       a  b         c
0    one  x -2.152185
2    two  x -0.063494
5  three  x  1.791891
6   four  x -1.378883

#  Dictionary-like get() method

In [36]:
s = pd.Series([1, 2, 3], index=['a', 'b', 'c'])

In [37]:
s.get('a')

np.int64(1)

#  Merge, join, concatenate and compare

concat()

In [38]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)

In [39]:
df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)

In [40]:

df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)

In [41]:
frames = [df1, df2, df3]
frames

[    A   B   C   D
 0  A0  B0  C0  D0
 1  A1  B1  C1  D1
 2  A2  B2  C2  D2
 3  A3  B3  C3  D3,
     A   B   C   D
 4  A4  B4  C4  D4
 5  A5  B5  C5  D5
 6  A6  B6  C6  D6
 7  A7  B7  C7  D7,
       A    B    C    D
 8    A8   B8   C8   D8
 9    A9   B9   C9   D9
 10  A10  B10  C10  D10
 11  A11  B11  C11  D11]

In [42]:
result = pd.concat(frames)

In [43]:
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

#  Joining logic of the resulting axis

The join keyword specifies how to handle axis values that don’t exist in the first DataFrame.

join='outer' takes the union of all axis values

In [45]:
df4 = pd.DataFrame(
    {
        "B": ["B2", "B3", "B6", "B7"],
        "D": ["D2", "D3", "D6", "D7"],
        "F": ["F2", "F3", "F6", "F7"],
    },
    index=[2, 3, 6, 7],
)
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [46]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [47]:
result = pd.concat([df1,df4],axis = 1 )

In [48]:
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

join='inner' takes the intersection of the axis values

In [51]:
result = pd.concat([df1,df4],axis = 1 , join='inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

To perform an effective “left” join using the exact index from the original DataFrame, result can be reindexed

In [54]:
result1 = pd.concat([df1,df4],axis = 1).reindex(df1.index)
result1

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

In [58]:
result3 = pd.concat([df1,df4],axis = 1).reindex(df4.index)
result3

     A    B    C    D   B   D   F
2   A2   B2   C2   D2  B2  D2  F2
3   A3   B3   C3   D3  B3  D3  F3
6  NaN  NaN  NaN  NaN  B6  D6  F6
7  NaN  NaN  NaN  NaN  B7  D7  F7

#  Ignoring indexes on the concatenation axis

For DataFrame objects which don’t have a meaningful index, the ignore_index ignores overlapping indexes.

In [63]:
rs = pd.concat([df1,df4],ignore_index=True , sort = False)
rs

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

#  Concatenating Series and DataFrame together

In [65]:
series = pd.Series(['A','B','C','D'] , name = "X")
series

0    A
1    B
2    C
3    D
Name: X, dtype: object

In [67]:
concat_series = pd.concat([df1,series] , axis = 1)
concat_series

    A   B   C   D  X
0  A0  B0  C0  D0  A
1  A1  B1  C1  D1  B
2  A2  B2  C2  D2  C
3  A3  B3  C3  D3  D

#  merge()

merge() performs join operations similar to relational databases like SQL.
 
# Merge types
merge() implements common SQL style joining operations.

one-to-one: joining two DataFrame objects on their indexes which must contain unique values.

many-to-one: joining a unique index to one or more columns in a different DataFrame.

many-to-many : joining columns on columns.

In [69]:
left = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [70]:
right = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [72]:
result = pd.merge(left, right, on="key")
result

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3